-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 02, 2026 at 09:53 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tourist_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `places`
--

CREATE TABLE `places` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `address` varchar(255) NOT NULL,
  `province` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `places`
--

INSERT INTO `places` (`id`, `name`, `address`, `province`, `description`, `image`, `created_at`) VALUES
(5, 'ดอยอินทนนท์ (Doi Inthanon)', 'ตำบลแม่แรม อำเภอแม่ริม จังหวัดเชียงใหม่', 'เชียงใหม่', 'ที่เที่ยวสำหรับชมวิวและธรรมชาติสุดฮิตเมื่อมาเที่ยวเชียงใหม่ ใช้เวลาขับรถจากตัวเมืองไม่นาน แถมเส้นทางก็ไม่ซับซ้อนจนเกินไปครับ ก็จะได้พบกับทัศนียภาพของภูเขาที่โอบล้อมตัวเรา แต่งแต้มด้วยดอกไม้หลากสีสันที่สลับกันเบ่งบานในแต่ละฤดู พร้อมร้านขายของทั้งผัก ผลไม้เมืองหนาว และสินค้าของท้องถิ่นให้เลือกช้อปกันแบบจุใจ', '1772439227_p4.webp', '2026-03-02 05:06:46'),
(6, 'เสาชิงช้า', 'ถนนบำรุงเมือง แขวงเสาชิงช้า เขตพระนคร กรุงเทพฯ', 'กรุงเทพมหานคร', '  เสาชิงช้า แลนด์มาร์คกลางใจกรุงเทพฯ ที่เรียกได้ว่าเป็น สัญลักษณ์ของกรุงเทพฯ เลยก็ว่าได้ เพราะฉะนั้นที่นี่จึงเป็นอีกหนึ่งที่เที่ยวที่ห้ามพลาดมาถ่ายรูปค่ะ อีกทั้งยังตั้งอยู่ใกล้กับ วัดสุทัศน์ หรือ วัดสุทัศนเทพวรารามราชวรมหาวิหาร ', '1772438787_p4.jpg', '2026-03-02 06:10:22'),
(9, 'เกาะสีชัง (Ko Sichang)', 'อําเภอเกาะสีชัง จังหวัดชลบุรี', 'ชลบุรี', 'อีกหนึ่งเกาะที่เที่ยวชลบุรี ที่ Drivehub อยากแนะนำให้ทุกคนมาครับ เพราะเกาะสีชังแห่งนี้มีสถานที่ท่องเที่ยวน่าสนใจมากมาย และยังเคยเป็นที่ตั้งของพระราชวังฤดูร้อนในสมัยรัชกาลที่ 5  บนเกาะสีชังมีสถานที่ท่องเที่ยวมากมาย แถมน้ำทะเลใส พร้อมที่พักให้เลือกพักหลากหลายสไตล์', '1772438353_p2.webp', '2026-03-02 07:21:20'),
(10, 'เกาะล้าน (Ko Lan)', 'ตำบลนาเกลือ อำเภอบางละมุง จังหวัดชลบุรี', 'ชลบุรี', 'ที่เที่ยวชลบุรีและพิกัดเกาะใกล้กรุงเทพฯ ก็ต้องอยู่ในลิสกับเขาด้วยแน่นอน เพราะเกาะล้านนั้น ถือเป็นแหล่งทะเลสวย น้ำใส หาดทรายขาว และที่พักสวยๆ อีกมากมาย', '1772437598_p1.webp', '2026-03-02 07:41:20'),
(11, 'หาดบางแสน (Bang Saen Beach)', '170 บางแสน สาย 2 ซอย 22 ตำบลแสนสุข อำเภอเมืองชลบุรี จังหวัดชลบุรี', 'ชลบุรี', 'มาเที่ยวชลบุรี แต่ไม่เคยแวะมาเช็คอินบางแสน ถือว่ามาไม่ถึงชลบุรีนะครับ บอกเลยว่าบางแสนในปัจจุบันน่าเที่ยวกว่าเดิมมาก เพราะมีการปรับทัศนียภาพริมชายหาดบางแสนใหม่ให้ดีกว่าเดิม ชายหาดสะอาด พร้อมด้วยร้านค้า ร้านอาหาร คาเฟ่ รวมไปถึงกิจกรรมริมทะเลให้ได้เล่นสนุกกัน', '1772438439_p3.webp', '2026-03-02 08:00:39'),
(12, 'สวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์ (Queen Sirikit Botanic Garden)', '101 ตำบลแม่แรม อำเภอแม่ริม จังหวัดเชียงใหม่', 'เชียงใหม่', 'สวนพฤกษศาสตร์ที่สมบูรณ์แบบที่สุดในประเทศไทย บนพื้นที่กว่า 3,000 ไร่ เต็มไปด้วยพืชพันธุ์ และดอกไม้นานาชนิด ไม่ว่าจะมองไปทางไหนก็น่าถ่ายรูปทุกมุมครับ แถมยังห้อมล้อมไปด้วยภูเขาใหญ่ จึงทำให้รู้สึกเหมือนกำลังถูกโอบอุ้มไปด้วยธรรมชาติ และที่สำคัญเลยคือห้ามพลาด การเดินชมธรรมชาติบนสะพานลอยฟ้า', '1772439459_p5.jpg', '2026-03-02 08:17:39');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `places`
--
ALTER TABLE `places`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `places`
--
ALTER TABLE `places`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
